backend/app/policies/city_policy.rb

SELECT "user_cities".* FROM "user_cities" WHERE "user_cities"."user_id" = $1 AND "user_cities"."city_id" = $2  [["user_id", 3], ["city_id", 1]]
---
  def question?
    user_cities = user.user_cities.where(city_id: record.id)
    user_cities.present?