backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "ivL99mMXPGrEUYvfbaCksDZb"], ["LIMIT", 1]]
---
  def current_user
    User.find_by(token: headers_token)