backend/app/controllers/api/cities_controller.rb

    def set_city
      @city = City.find_by(name: city_query_name)
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Rijeka"], ["LIMIT", 1]]

    def city_description
      City.find_by(name: city_name).description
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Zagreb"], ["LIMIT", 1]]