backend/app/controllers/api/cities_controller.rb

    def set_city
      @city = City.find(city_id)
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]