backend/app/controllers/api/questions_controller.rb

    def update_status
      @user_cities.find_by(city_id: city_id).update(status: 'active')
---
UPDATE "user_cities" SET "status" = $1, "updated_at" = $2 WHERE "user_cities"."id" = $3  [["status", "active"], ["updated_at", "2023-10-29 16:41:56.816564"], ["id", 1]]

    def set_city
      @city = City.find(city_id)
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]