backend/app/controllers/api/questions_controller.rb

UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["points", 6], ["updated_at", "2023-12-11 23:35:43.838451"], ["id", 1]]
---
    def update_user(score)
      current_points = current_user.points
      current_user.update(points: current_points + score)

SELECT "questions".* FROM "questions" WHERE "questions"."city_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["city_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def question(question_id)
      city.questions.find(question_id)

UPDATE "user_cities" SET "status" = $1, "score" = $2, "updated_at" = $3 WHERE "user_cities"."id" = $4  [["status", "active"], ["score", "1"], ["updated_at", "2023-12-11 23:35:43.846774"], ["id", 1]]
---
    def update
      return if user_city.status.eql?('active')

      data = check_answers
      user_city.update(status: 'active', score: data[:counter])