backend/app/controllers/api/quiz_controller.rb

SELECT "user_cities".* FROM "user_cities" WHERE "user_cities"."user_id" = $1 AND "user_cities"."city_id" = $2 LIMIT $3  [["user_id", 1], ["city_id", 1], ["LIMIT", 1]]
---
    def current_city
      @user_cities.find_by(city_id: city_id).city