backend/app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Dominik"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(name: user_name)