backend/app/controllers/api/user_cities_controller.rb

    def user_points
      @user_cities.first.user.points
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]