backend/app/queries/user_cities_query.rb

SELECT "cities".* FROM "cities" ORDER BY "cities"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def update_user_cities
    City.find_each { |city| create_record(city.id) }

INSERT INTO "user_cities" ("user_id", "city_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["city_id", 1], ["status", "active"], ["created_at", "2023-12-11 23:54:41.031717"], ["updated_at", "2023-12-11 23:54:41.031717"]]
---
  def create_record(city_id)
    relation.create(city_id: city_id, user_id: @user_id, status: 'active')